Revit 2027 API
TessellatedShapeBuilder.DoesFaceHaveEnoughLoopsAndVertices Method
 Checks whether 'face' has enough loops and vertcies to be valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool DoesFaceHaveEnoughLoopsAndVertices(
	TessellatedFace face
)
Public Function DoesFaceHaveEnoughLoopsAndVertices (
	face As TessellatedFace
) As Boolean
public:
bool DoesFaceHaveEnoughLoopsAndVertices(
	TessellatedFace^ face
)
member DoesFaceHaveEnoughLoopsAndVertices :
        face : TessellatedFace -> bool
Parameters
face TessellatedFace
 The face to check.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Face 'face' is not modified.
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace